// 1)რა განსხვავებაა let, const შორის?

// let და const არის ცვლადები რომლებიც გამოიყენება მნიშვნელობის მისანიჭებლად მათ შორის უმთავრესი განსხვავება არის ის, რომ let ის შეცვლა შესაძლებელია ხოლო const უცვლელია let ის შეცვლა შემდეგნაიარადაა შესაძლებელი let name = gio; name = nika ახლა რომ დავაკონსოლოთ name ამოაგდებს ნიკას ხოლო const ზე რომ იგივე ვქნათ ერორს დაგვირყამს ასევე ისინი ორივენი არიან ბლოკ სქოუფდი,

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?

//primitive type არის მაგალითად string ხოლო nonprimitive type კი მაგალიტად array. მაგალითად ჩვენ გვინდა სტრინგზე მუტაციის მოხდენა.    let name = gio და ასო i ს ნაცვლად რომ ჩავწეროთ e ამას ასე ვერ გავაკეთებთ name[1] = 'e' კონსოლი მაინც gio ს დააბრუნებს ამისთვის ჩვენ let name = gio; name = geo  ეს უნდა გავაკეთოთ ანუ gio ს გადავაწეროთ geo ამიტომ არის ეს პრიმიტიული რომ კონკრეტული ასოების მისამართის პოვნა ჩვენთვის შეუძლებელია და ამიტომ არგამოვიდა ინდექსით შეცვლის გეგმა ხოლო array ის შემთხვევაში ეს ყველაფერი სხვანაირადაა. მაგალითად გვაქვს array = [ბანანი,ვაშლი,გრეიფრუტი] ჩვენ შეგვიძლია მივაგნოთ ბანანის მისამართს და მუტაცია მოვახდინოთ ჩვეულებრივად array[0] = 'მარწყვი' და ამით კონსოლი დაგვიბრუნებს [მარწყვი,ვაშლი,გრეიფრუტი]

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?

// განსხვავება == და === ამათ შორის. მაგალითად '5' == 5 ? ეს დააბრუნებს true ხოლო '5' === 5 ? ეს დააბრუნებს false რადგან პირველ შემთხვევაში გვაქვს ორი ტოლობა რომელმაც დაინახა რომ ორივეს მნიშვნელობა არის 5 შესაბამისად დააბრუნა true ხოლო მეორე ტოლობამ ანუ სადაც გვიწერია სამი ტოლობა დააბრუნა false რადგან დაინახა რომ მნიშვნელობები ემთხვევა თუმცა type ები არა პირველი 5იანი არის სტრინგი მეორე - რიცხვი ამიტომ დააბრუნა false; შესაბამისად ორი ტოლობა ამოწმებს მხოლოდ მნიშვნელობებს და სამი ტოლობა მნიშვნელობებს და type ებს

// 4)რა ტიპის არის null

//type of null -ის არის ობიექტი რადგან ეს არის ბაგი რომელიც დღემდე არ გამოუსწორებიათ

// 5)რა განსხვავებაა funtion და = () => {} შორის

// ჩვეულებრივი ფუნქცია არის უფრო ძლიერი arrow ფუნქციასთან შედარებით სწორედ ამიტომ ჩვენ შეგვიძლია გამოვიძახოტ ფუნქცია ჯერ და შემდეგ აღვწეროთ იგი ხოლო arrow ფუნქცია კი სადაც დაიწერება იქ არის მისი ფუნქცია და მას მისი აღწერის შემდეგ გამოვიყენებთ ჩვეულებრივ ფუნქცია აქვს საკუთარი this. ის დინამიურია და დამოკიდებულია იმაზე, თუ როგორ გამოიძახებ ფუნქციას. arrow ფუნქციას არ აქვს საკუთარი this. ის მემკვიდრეობით იღებს this - ს იმ გარემოდან, სადაც ის შეიქმნა.

// 6)რას ნიშნავს callback function?

// Callback function არის ფუნქცია, რომელიც გადაეცემა არგუმენტად სხვა ფუნქციას და რომლის გამოძახება მოგვიანებით, გარკვეული მოქმედების დასრულების შემდეგ მოხდება. callback-ებს ხშირად გამოიყენება ასინქრონულ ფუნქციებში, როდესაც გვინდა, რომ კოდმა გააგრძელოს მუშაობა და კონკრეტული ფუნქცია მხოლოდ მაშინ შესრულდეს, როცა წინაპირობა დასრულდება.

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?

//სამივენი არის ობიექტების მეთოდები თუმცა დანიშნულება სხვადასხვააქვთ რათქმაუნდა. map გამოიყენება მასივის თითოეული ელემენტის მოდიფიკაციისთვის.ის აბრუნებს ახალ მასივს, რომელშიც იქნება იგივე რაოდენობის ელემენტები, რაც საწყისში, ოღონდ შეცვლილი სახით. ის აბრუნებს ფუნქციის მიერ დაბრუნებულ ნებისმიერ ახალ მნიშვნელობას თითოეულ ელემენტზე. filter გამოიყენება ობიექტის გაფილტრისთვის მას გადავცემთ გარკვეულ პირობას რომლის შედეგადაც ეს მეთოდი ობიექტს გაფილტრავს და დატოვებს იმათ მხოლოდ რომელიც ამ პირობას ასრულებს. reduce კი უშუალოდ გამოიყენება რაღაცის დასაჯამებლად, შესაკრებად, შესაერთებლად, დასაჯგუფებლად მას ბევრი დანიშნულებააქ მისი საშუალებით მარტივად გამოვთვლით ერეიში არსებული ელემენტების ჯამს, ასევე დავთვლით თუ რამდენჯერ მეორდება კონკრეტული რიცხვი ან სტრინგი და ასე შემდეგ.

// 8)რა არის Promise?

// Promise არის JavaScript-ის ობიექტი, რომელიც გამოიყენება ასინქრონული ფუნქციებისთვის. ის არის ერთგვარი დაპირება იმისა, რომ ოპერაცია მომავალში დასრულდება შედეგით ან შეცდომით.მას აქვს სამი მდგომარეობა: pending, fulfilled და rejected . Promise იღებს ფუნქციას ორი არგუმენტით: resolve წარმატებისას გამოძახებისთვის და reject შეცდომის გამოძახებისთვის .async/await გვეხმარება Promise-ებთან მუშაობაში, რონ ის უფრო მარტივი, სინქრონული კოდის მსგავსი გავხადოთ, თუმცა Promise-ის გამოყენება მათ გარეშეც შესაძლებელია .then() და .catch() მეთოდებით.

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?

// Promise.all ელოდება ყველა Promise-ის დასრულებას. თუ ყველა წარმატებით დასრულდა, მაშინ აბრუნებს შედეგების მასივს. თუ ერთი მაინც დარეჯექთდა, მთელი მეთოდი მაშინვე დარეჯექთდება.Promise.any აბრუნებს პირველ წარმატებულ შედეგს. ის ყურადღებას არ აქცევს ჩავარდნილ პრომისებს, თუ მინიმუმ ერთი მაინც შესრულდა წარმატებით. ის მხოლოდ იმ შემთხვევაში დარეჯექთდება, თუ ყველა პრომისი დარეჯექთდება.Promise.race აბრუნებს ყველაზე სწრაფად დასრულებულის შედეგს, მიუხედავად იმისა, ეს შედეგი წარმატებულია თუ შეცდომა, რომელიც პირველი დასრულდება იმას დააბრუნებს.

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?

//ფუნქციის წინ async keywordის დაწერა ავტომატურად აქცევს ფუნქციას ასინქრონულად, იგი ყოველთვის აბრუნებს Promise-ს.await გამოიყენება მხოლოდ async ფუნქციის შიგნით და ის აიძულებს კოდს, შეჩერდეს და დაელოდოს Promise-ის დასრულებას.await სწორედ იმისთვისაა, რომ კოდი გამოიყურებოდეს და იკითხებოდეს სინქრონულად. როდესაც await-ს ვწერთ, JavaScript აჩერებს კონკრეტულად ამ async ფუნქციის შესრულებას მანამ, სანამ დაპირებული შედეგი არ მოვა, მაგრამ არ აჩერებს მთლიანად ბრაუზერს ან პროგრამას. სხვა პროცესები ჩვეულებრივად მუშაობს.

// 11)რა განსხვავებაა class-სა და object-ს შორის?

//Class არის ეგრედწოდებული შაბლონი, რომელიც აღწერს ობიექტის სტრუქტურას, ხოლო Object არის ამ შაბლონის საფუძველზე შექმნილი კონკრეტული ნიმუში, რომელიც შეიცავს რეალურ მონაცემებს. კლასი მეხსიერებას არ იკავებს და ის არის მხოლოდ ნახაზი, ხოლო ობიექტი პირიქით, იგი იკავებს მეხსიერებას და წარმოადგენს პროგრამაში არსებულ რეალურ ინფორმაციას. კლასიდან შეიძლება შევქმნათ შეუზღუდავი რაოდენობის ობიექტი.

// 12)რას აკეთებს constructor class-ში?

// სწორედ constructor გვაძლევს იმის საშუალებას რომ კლასში ცავაწოდოთ გარკვეული არგუმენტები. constructor ში პარამაეტრებს შევქმნით შემდეგ თ გვინდა მას მთლიანი კლასისთვის ხელმისაწვდომს გავხდით this. keyword ის დახმარებით და შემდეგ მას გამოვიყენებთ როგორც გვინდა და რა ნაწილშიც დაგვჭირდება.

//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის

//მემორი ჰიპში ინახება არაპრიმიტიული ხოლო მემორი სტეკში პრიმიტიული ცვლადები

//14) რა არის ქოლსტეკი

// Call Stack არის მონაცემთა სტრუქტურა, სადაც JavaScript ინახავს ინფორმაციას ფუნქციების გამოძახების შესახებ. მასში ბოლოს გამოძახებული ფუნქცია პირველი სრულდება. Call Stack-ში ხვდება მხოლოდ სინქრონული კოდი, ხოლო ასინქრონული დავალებები, როგორიცაა Promise, ელოდებიან თავის რიგს სხვა რიგებში, სანამ Call Stack-ი არ დაიცლება.

//15) რა არის ივენთ ლუპი

// Event Loop ივენთ ლუპი არის უწყვეტი ციკლი, რომელიც მუდმივად ამოწმებს ორ რამეს არის თუ არა Call Stack ცარიელი და არის თუ არა რაიმე დავალება რიგში? თუ Call Stack ცარიელია, ივენთ ლუპი რიგიდან იღებს პირველ დავალებას და გადააქვს ის Call Stack-ში შესასრულებლად. სწორედ ეს პროცესი უზრუნველყოფს, რომ ასინქრონული კოდი შესრულდეს მხოლოდ მაშინ, როცა სინქრონული დავალებები დასრულებულია.
